In [1]:
import numpy as np
import pandas as pd

In [3]:
df_rating = pd.read_csv(
    'datas/ml-1m/ratings.dat',
    sep="::",
    engine='python',
    names=['UserId', 'MoviesId', "Rating", 'TimeStamp']
)

In [4]:
df_rating.shape

(1000209, 4)

In [5]:
df_rating.head()

   UserId  MoviesId  Rating  TimeStamp
0       1      1193       5  978300760
1       1       661       3  978302109
2       1       914       3  978301968
3       1      3408       4  978300275
4       1      2355       5  978824291

In [6]:
df_movies = pd.read_csv(
    'datas/ml-1m/movies.dat',
    sep='::',
    engine='python',
    names=['MoviesId', 'Title', 'Genres']
)

In [7]:
df_movies.shape

(3883, 3)

In [8]:
df_movies.head()

   MoviesId                               Title                        Genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [9]:
df_users = pd.read_csv(
    'datas/ml-1m/users.dat',
    sep='::',
    engine='python',
    names=['UserId','Gender','Age','Occupation','Zip-code']
)

In [11]:
df_users.shape

(6040, 5)

In [12]:
df_users.head()

   UserId Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [14]:
df_rating_users = pd.merge(df_rating, df_users, left_on='UserId', right_on='UserId', how='inner')

In [16]:
df_rating_users.shape

(1000209, 8)

In [15]:
df_rating_users.head()

   UserId  MoviesId  Rating  TimeStamp Gender  Age  Occupation Zip-code
0       1      1193       5  978300760      F    1          10    48067
1       1       661       3  978302109      F    1          10    48067
2       1       914       3  978301968      F    1          10    48067
3       1      3408       4  978300275      F    1          10    48067
4       1      2355       5  978824291      F    1          10    48067

In [17]:
df_rating_users_movies = pd.merge(df_rating_users, df_movies, left_on='MoviesId', right_on='MoviesId', how='inner')

In [18]:
df_rating_users_movies.shape

(1000209, 10)

In [19]:
df_rating_users_movies.head()

,UserId,MoviesId,Rating,TimeStamp,Gender,Age,Occupation,Zip-code,Title,Genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [20]:
left = pd.DataFrame({
    'number' : [1,2,3,4],
    'name' : ['tom','jack','lucy','lily']
})

In [21]:
left

   name  number
0   tom       1
1  jack       2
2  lucy       3
3  lily       4

In [25]:
right = pd.DataFrame({
    'number':[1,2,3,4],
    'age' : [20,25,30,35]
})

In [26]:
right

   age  number
0   20       1
1   25       2
2   30       3
3   35       4

In [27]:
# 一对一关系
left_right = pd.merge(left, right, left_on='number', right_on='number', how='inner')

In [28]:
left_right

   name  number  age
0   tom       1   20
1  jack       2   25
2  lucy       3   30
3  lily       4   35

In [29]:
left = pd.DataFrame({
    'number' : [1,2,3,4],
    'name' : ['tom','jack','lucy','lily']

})

In [32]:
right = pd.DataFrame({
    'number' : [1,1,2,2,3,4],
    'hobby':['乒乓','羽毛球','乒乓','羽毛球','篮球','足球']

})

In [33]:
left_right = pd.merge(left, right, left_on='number', right_on='number', how='inner')

In [34]:
left_right

   name  number hobby
0   tom       1    乒乓
1   tom       1   羽毛球
2  jack       2    乒乓
3  jack       2   羽毛球
4  lucy       3    篮球
5  lily       4    足球

In [35]:
left = pd.DataFrame({
    'number':[1,1,2,2,3,4],
    'hobby':['乒乓','羽毛球','乒乓','羽毛球','篮球','足球']
})

In [36]:
left

  hobby  number
0    乒乓       1
1   羽毛球       1
2    乒乓       2
3   羽毛球       2
4    篮球       3
5    足球       4

In [37]:
right = pd.DataFrame({
    'number':[1,2,3,3,4,4],
    'subject':['math100','math90','science100','math70','english80','english90']
})

In [38]:
right

   number     subject
0       1     math100
1       2      math90
2       3  science100
3       3      math70
4       4   english80
5       4   english90

In [39]:
left_right = pd.merge(left, right, left_on='number', right_on='number', how='inner')

In [40]:
left_right

  hobby  number     subject
0    乒乓       1     math100
1   羽毛球       1     math100
2    乒乓       2      math90
3   羽毛球       2      math90
4    篮球       3  science100
5    篮球       3      math70
6    足球       4   english80
7    足球       4   english90

In [41]:
left = pd.DataFrame({
    'key':['k1','k2','k3','k4'],
    'A':['A1','A2','A3','A4'],
    'B':['B1','B2','B3','B4'],
})

In [42]:
left

    A   B key
0  A1  B1  k1
1  A2  B2  k2
2  A3  B3  k3
3  A4  B4  k4

In [47]:
right = pd.DataFrame({
    'key':['k1','k2','k5','k6'],
    'C':['C1','C2','C5','C6'],
    'D':['D1','D2','D5','D6']
})

In [48]:
right

    C   D key
0  C1  D1  k1
1  C2  D2  k2
2  C5  D5  k5
3  C6  D6  k6

In [49]:
left_right = pd.merge(left, right,on='key', how='inner')

In [50]:
left_right

    A   B key   C   D
0  A1  B1  k1  C1  D1
1  A2  B2  k2  C2  D2

In [51]:
left_right = pd.merge(left, right,on='key',how='left')

In [52]:
left_right

    A   B key    C    D
0  A1  B1  k1   C1   D1
1  A2  B2  k2   C2   D2
2  A3  B3  k3  NaN  NaN
3  A4  B4  k4  NaN  NaN

In [53]:
left_right = pd.merge(left,right,on='key',how='right')

In [54]:
left_right

     A    B key   C   D
0   A1   B1  k1  C1  D1
1   A2   B2  k2  C2  D2
2  NaN  NaN  k5  C5  D5
3  NaN  NaN  k6  C6  D6

In [55]:
left_right = pd.merge(left,right,on='key',how='outer')

In [56]:
left_right

     A    B key    C    D
0   A1   B1  k1   C1   D1
1   A2   B2  k2   C2   D2
2   A3   B3  k3  NaN  NaN
3   A4   B4  k4  NaN  NaN
4  NaN  NaN  k5   C5   D5
5  NaN  NaN  k6   C6   D6

In [57]:
left = pd.DataFrame({
    'key':['k1','k2','k3','k4'],
    'A':['A1','A2','A3','A4'],
    'B':['B1','B2','B3','B4'],
})

In [59]:
right = pd.DataFrame({
    'key':['k1','k2','k5','k6'],
    'A':['C1','C2','C5','C6'],
    'D':['D1','D2','D5','D6']
})

In [60]:
left

    A   B key
0  A1  B1  k1
1  A2  B2  k2
2  A3  B3  k3
3  A4  B4  k4

In [61]:
right

    A   D key
0  C1  D1  k1
1  C2  D2  k2
2  C5  D5  k5
3  C6  D6  k6

In [62]:
left_right = pd.merge(left, right, on='key', how='inner')

In [63]:
left_right

  A_x   B key A_y   D
0  A1  B1  k1  C1  D1
1  A2  B2  k2  C2  D2

In [64]:
left_right = pd.merge(left,right,on='key',how='inner',suffixes=['_left','_right'])

In [65]:
left_right

  A_left   B key A_right   D
0     A1  B1  k1      C1  D1
1     A2  B2  k2      C2  D2